Autodesk.Revit.DB.ParameterValue.IsSameType(Autodesk.Revit.DB.ParameterValue)
Tests another instance is of the same value type.
other:
The instance to compare with
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016 Subscription Update

Autodesk.Revit.DB.ParameterValue.IsEqual(Autodesk.Revit.DB.ParameterValue)
Tests equality with another instance of the same class.
Remarks:
The result is always False if the two comparands are of a different value types.
other:
The instance to compare with
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016 Subscription Update